Revit 2026 API

# StairsComponentConnection Properties

---

The StairsComponentConnection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionType | The connection type of the connected stairs component. |
|  | ElementId | The element Id of connected stairs component in the stairs connection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PeerConnectionType | The connection type of the peer connected stairs component. |
|  | PeerElementId | The element Id of peer connected stairs component in the stairs connection. |

#### Reference

StairsComponentConnection Class

Autodesk.Revit.DB.Architecture Namespace